{
  "members": [
    {
      "id": 1,
      "name": "Chaeyoung",
      "full_name": "Son Chae-young",
      "image": "/images/profile-images/chaeyoung_profile.jpg",
      "birthday": "April 23, 1999",
      "birthplace": "Seoul, South Korea",
      "height": "5'3\"(159cm)",
      "weight": "101.4 lbs (46kg)",
      "zodiac_sign": "Taurus",
      "blood_type": "B",
      "position": "Main Rapper, Vocalist",
      "representative_color": "Red",
      "facts": [
        "Chaeyoung has a younger brother, Jeong Hun, which is an aspiring model.",
        "She passed the audition on June 6, 2012.",
        "She loves to draw.",
        "Chaeyoung chose 29 as her fav. no., because 2 (TWICE) and 9 (Number of members).",
        "She doesn’t like beans. Nayeon makes fun of her because of that.",
        "She and Dahyun are in charge of washing the dishes at the dorm.",
        "Chaeyoung likes healthy foods like veggies but doesn’t like sweets. She says this is because she grew up with her grandmother when she was young.",
        "Chaeyoung is good at making certain sounds like wild-duck-quacking sound or window-wiping sound.",
        "Chaeyoung and Tzuyu often sing PPAP.  (Pen-Pineapple-Apple-Pen – PPAP Song)",
        "Chaeyoung and BLACKPINK’s Chaeyoung (Rosé) are close."
      ]
    },
    {
      "id": 2,
      "name": "Mina",
      "full_name": "Mina Sharon Myoi",
      "image": "/images/profile-images/mina_profile.jpg",
      "birthday": "March 24, 1997",
      "birthplace": "San Antonio, United States",
      "height": "5'4\" (163cm)",
      "weight": "101.4 lbs (46kg)",
      "zodiac_sign": "Aries",
      "blood_type": "A",
      "position": "Main Dancer, Vocalist",
      "representative_color": "Mint Green",
      "facts": [
        "She moved to Kobe, Japan, when she was a toddler.",
        "She has an older brother.",
        "Mina got cast while shopping with her mom.",
        "She auditioned for a JYP audition in Japan and joined the trainee program in South Korea on January 2, 2014.",
        "She is the member who had the shortest training period before debuting as a member of Twice.",
        "She got into K-Pop when she did a cover with her friend using a song by Girls Generation.",
        "She’s a really quiet person in public.",
        "She learned ballet for 11 years.",
        "Mina chose 37 as her fav. no., because “37” in Japanese it’s pronounced as “Mi” or “San” (3) and “Nana” [often shortened to Na] (7).",
        "Her hobbies are looking up restaurants online and shopping."
      ]
    },
    {
      "id": 3,
      "name": "Jihyo",
      "full_name": "Park Ji-hyo",
      "image": "/images/profile-images/jihyo_profile.jpg",
      "birthday": "February 1, 1997",
      "birthplace": "Guri, South Korea",
      "height": "5'3\" (160cm)",
      "weight": "108 lbs (49kg)",
      "zodiac_sign": "Aquarius",
      "blood_type": "O",
      "position": "Leader, Main Vocalist",
      "representative_color": "Apricot",
      "facts": [
        "She was born in Guri, Gyeonggi-do, South Korea.",
        "Jihyo has 2 younger sisters, Seoyeon and Jiyoung.",
        "She became a JYP trainee when she was a third grader, after she won the 2nd place in a contest on Junior Naver for a child role.",
        "She is the Twice member who trained the most. She trained for 10 years.",
        "She trained with WG, 2pm, 2am, miss A, Got7 and literally everyone in JYP knows her.",
        "She was voted leader by the members and not JYP himself (by anonymous voting).",
        "Jihyo’s real name is Park Jisoo. She legalized her name to Park Jihyo right before Sixteen.",
        "She is nicknamed “Hyo-mas” or “Thomas the train” for her big eyes and she is able to mimic Thomas.",
        "In her pre-debut days, Ji-hyo was well recognized as the face of Innisfree’s teen line “TN”.",
        "Jihyo’s favorite color is red."
      ]
    },
    {
      "id": 4,
      "name": "Jeongyeon",
      "full_name": "Yoo Kyung-wan",
      "image": "/images/profile-images/jeongyeon_profile.jpg",
      "birthday": "November 1, 1996",
      "birthplace": "Suwon, South Korea",
      "height": "5'6\" (168cm)",
      "weight": "108 lbs (49kg)",
      "zodiac_sign": "Scorpio",
      "blood_type": "O",
      "position": "Lead Vocalist",
      "representative_color": "Olive Green",
      "facts": [
        "She was born in Suwon, South Korea.",
        "Jeongyeon’s birth name is Yoo Kyung Wan. She changed her name in 3rd grade because she was teased because her name sounded like a boy’s name.",
        "She has 2 older sisters: Gong Seungyeon (actress) and Seo Yeon (office worker).",
        "When Jeongyeon was young, she failed the JYP audition. She became a trainee after passing the JYP Entertainment’s 6th Open Audition on March 1, 2010.",
        "Jeongyeon was accepted into JYP and SM in the same day, but chose JYP.",
        "The leader of Twice was decided by anonymous voting. Jeongyeon was in 2nd place.",
        "Jeongyeon likes ddeokbokki, meat, and golbangee muchim. She doesn’t like lotus, though.",
        "Jeongyeon chose 0 as her favorite number, because she doesn’t actually have a favorite number.",
        "Jeongyeon is ambidextrous. (Twice Showtime)",
        "The happiest part of Jeongyeon’s day is taking off her contact lenses."
      ]
    },
    {
      "id": 5,
      "name": "Nayeon",
      "full_name": "Im Na-yeon",
      "image": "/images/profile-images/nayeon_profile.jpg",
      "birthday": "September 22, 1995",
      "birthplace": "Seoul, South Korea",
      "height": "5'4\" (163cm)",
      "weight": "103.6 lbs (47kg)",
      "zodiac_sign": "Virgo",
      "blood_type": "A",
      "position": "Lead Vocalist, Lead Dancer, Center",
      "representative_color": "Sky Blue",
      "facts": [
        "Nayeon has a younger sister named Im Seo-Yeon.",
        "When she was a kid, Nayeon entered a child model contest and got cast by JYP. At the time, her mom refused, but 10 years later, in 2010, she secretly entered a JYP open audition and passed.",
        "Nayeon was chosen for JYP’s girl group 6mix but they disbanded and never debuted.",
        "She was the first Sixteen member to be announced and also the first member to be confirmed in Twice.",
        "Nayeon cannot eat sushi that isn’t salmon sushi, and also cannot eat chicken feet.",
        "She likes jellies. She likes sweet foods.",
        "Nayeon’s favorite color is purple (vLive).",
        "Nayeon chose 9 as her favorite number, because TWICE has 9 members.",
        "Nayeon’s left leg is weak due to her being in a car accident when she was still in her childhood days.",
        "Nayeon chose 9 as her favorite number, because TWICE has 9 members."
      ]
    },
    {
      "id": 6,
      "name": "Dahyun",
      "full_name": "Kim Da-hyun",
      "image": "/images/profile-images/dahyun_profile.jpg",
      "birthday": "May 28, 1998",
      "birthplace": "Gyeonggi-do, South Korea",
      "height": "5'2\" (158cm)",
      "weight": "108 lbs (49kg)",
      "zodiac_sign": "Gemini",
      "blood_type": "O",
      "position": "Lead Rapper, Vocalist",
      "representative_color": "White",
      "facts": [
        "Dahyun has an older brother, Myung Soo.",
        "In middle school, she performed a solo in a youth dance festival and was scouted by JYP Entertainment.",
        "She passed the audition on July 7, 2012, and officially became a trainee.",
        "She auditioned for SM, JYP, and YG as the same time and got accepted by all 3 companies, but she chose JYP.",
        "Dahyun is scared of animals (cats, dogs, etc.).",
        "Pre-debut she was very popular due to her Eagle dance video which went viral in South Korea.",
        "Her nickname is ‘Tofu’ because of her white skin.",
        "She was the most popular during Sixteen.",
        "Dahyun chose 7 as her fav. no., because she became a TWICE member on July 7th and because she’s the 7th oldest in TWICE.",
        "Dahyun’s favorite drink is chocolate milk. She likes all sorts of milk."
      ]
    },
    {
      "id": 7,
      "name": "Tzuyu",
      "full_name": "Chou Tzuyu",
      "image": "/images/profile-images/tzuyu_profile.jpg",
      "birthday": "June 14, 1999",
      "birthplace": "Tainan, Taiwan",
      "height": "5'8\" (172cm)",
      "weight": "105.8 lbs (48kg)",
      "zodiac_sign": "Gemini",
      "blood_type": "A",
      "position": "Lead Dancer, Vocalist, Visual, Maknae",
      "representative_color": "Blue",
      "facts": [
        "Tzuyu has an older brother.",
        "She was discovered by JYP at the MUSE Performing Arts Workshop in Tainan in 2012 and went to South Korea on November 15 to start her training.",
        "Her nicknames are “Chocolate” because of her dark skin, “Chewy” and “Yoda”.",
        "Tzuyu likes Yoda (“Star Wars”) and can impersonate him well, that’s why her nickname is Yoda.",
        "Tzuyu’s family has a dog named Gucci, her mom’s friend named it after the brand.",
        "Tzuyu likes tonkatsu and kimbap.",
        "Tzuyu’s favorite number is 25, because she thinks it is a cool number.",
        "The body parts that Tzuyu has the most confidence in are her eyes and chin.",
        "Tzuyu is close to Rosé (BLACKPINK) and CLC‘s Elkie.",
        "Tzuyu said that, if she were to be born again, she wants to be born as a short girl."
      ]
    },
    {
      "id": 8,
      "name": "Momo",
      "full_name": "Hirai Momo",
      "image": "/images/profile-images/momo_profile.jpg",
      "birthday": "November 9, 1996",
      "birthplace": "Kyoto, Japan",
      "height": "5'4\" (164cm)",
      "weight": "105.8 lbs (48kg)",
      "zodiac_sign": "Scorpio",
      "blood_type": "A",
      "position": "Main Dancer, Vocalist, Rapper",
      "representative_color": "Pink",
      "facts": [
        "She was born in Kyōtanabe, Kyoto, Japan.",
        "She has an older sister, named Hana. (2 years older than Momo)",
        "She was scouted by JYP Entertainment after they saw a dance video of her and her older sister.",
        "She passed the audition on April 13, 2012. Her sister didn’t make it though.",
        "Momo was eliminated in ep 6 of SIXTEEN, but J.Y.Park decided to add her as a member of Twice, because of her dancing skills.",
        "Momo means Peach in Japanese.",
        "Momo has the most confidence in dancing to urban. She also likes dancing to hip-hop.",
        "She started taking dancing lessons when she was 3 years old because she wanted to follow her older sister.",
        "She is a big food lover. She especially likes jokbal (a Korean dish consisting of pig’s trotters cooked with soy sauce and spices).",
        "Momo chose 64 as her favorite no., because it’s the number on her father’s shirt when he plays football."
      ]
    },
    {
      "id": 9,
      "name": "Sana",
      "full_name": "Sana Minatozaki",
      "image": "/images/profile-images/sana_profile.jpg",
      "birthday": "December 29, 1996",
      "birthplace": "Osaka, Japan",
      "height": "5'6\" (168cm)",
      "weight": "103.6 lbs (47kg)",
      "zodiac_sign": "Capricorn",
      "blood_type": "B",
      "position": "Lead Dancer, Vocalist",
      "representative_color": "Purple",
      "facts": [
        "Sana is an only child.",
        "Sana got cast while she was shopping with her friends.",
        "She passed the audition on April 13, 2012.",
        "Sana’s specialty is calligraphy. She learned it in primary school.",
        "Sana is very clumsy.",
        "She has an optimistic personality.",
        "Sana’s hobbies are collecting perfumes and body mists.",
        "Sana likes the colors purple, pink, white, black, and beige. But she doesn’t like purple clothing.",
        "Sana chose 12 as her favorite number (her birthday month), because Mina took the number 37.",
        "Sana is ranked 46th on TC Candler “The 100 Most Beautiful Faces of 2018”."
      ]
    }
  ]
}

